---
kind: property
id: P:Autodesk.Revit.DB.Categories.IsEmpty
source: html/1bbb1e15-53a2-277e-0f87-2ec61124e4be.htm
---
# Autodesk.Revit.DB.Categories.IsEmpty Property

Whether or not the list of top-level categories is empty.

## Syntax (C#)
```csharp
public override bool IsEmpty { get; }
```